"""
https://kongruksiam.medium.com/สรุป-machine-learning-ep-5-การจัดหมวดหมู่ด้วย-naive-bayes-eb9ce0e1b010
เป็น การเรียนรู้แบบมีผู้สอน (Supervised Machine Learning Algorithms) ในข้อมูลมีชุดเฉลยอยู่แล้ว
Naive Bayes Classification เป็นการจัดหมวดหมู่โดยใช้หลักความน่าจะเป็นเข้ามาช่วยคำนวณ

สมการ
P(c|x) = (P(x|c)* P(c)) / P(x)

อธิบายสมการ แทนตัวแปร 3 ตัว คือ
c คือ Class -> กลุ่มใด เช่น ข้อมูลกลุ่ม A ประกอบไปด้วย Attribute 1 2 3 เป็นต้น
x คือ Attribute -> ข้อมูลที่เกี่ยวข้อง
P คือ Probability (ความน่าจะเป็น)

P(c|x) Posterior probability คือ ความน่าจะเป็นที่ข้อมูลที่มี Attribute เป็น x เป็นพื้นฐาน จะมี Class C
P(x|c) Likelihood คือ ความน่าจะเป็นที่ข้อมูลที่มี Class C และมี Attribute x เป็นพื้นฐาน
P(c) Prior probability คือ จำนวน Class ที่อาจจะเกิดขึ้น/จำนวนClass ทั้งหมด หรือความน่าจะเป็นของ Class C 
แบ่งช่วงเป็น 0-1 คิดเป็น % คือ 0-100%
P(x) Predictor Prior probability คือ จำนวน Attribute ทั้งหมด

#จากตัวอย่างข้อมูล 
มี 1 Class แบ่ง Classifier เป็น เพศชาย/เพศหญิง
กำหนดค่าตัวแปรในสมการได้ ดังนี้
c คือ Class (เพศชาย/เพศหญิง)
x คือ Attribute (สีผิว) อยากทราบว่า ชายผิวสีขาวกี่ % และ หญิง กี่ %
P คือ Probability (ความน่าจะเป็น)

จำนวน เพศหญิงใน Dataset = 10
จำนวน เพศชายใน Dataset = 5

P(x|c) Likelihood 
    ความน่าจะเป็นที่ข้อมูลที่มีคลาส C และมีแอตทริบิวต์ x หมายถึง ความน่าจะเป็นที่ข้อมูลชาย-หญิงจะมีคนที่มีสีผิว น้ำหนัก ส่วนสูง
    ตามเกณฑ์ที่กำหนด เช่น
        - ในจำนวนผู้หญิง 10 คน มีผิวสีขาว 9 คน ค่า P(x|c=เพศหญิง) = 9/10
        - ในจำนวนผู้ชาย 5 คน มีผิวสีขาว 3 คน ค่า P(x|c=เพศชาย) = 3/5

P(c) Prior probability คือ ความน่าจะเป็นของ Class
    คือจำนวนของ Class / Class ทั้งหมด
    - ถ้าคิดค่า P(c) ของผู้หญิง = 10/15 -> ผู้หญิง 10 คน ต่อ คนทั้งหมด 15 คน
    - ถ้าค่า P(c) ของผู้ชาย = 5/15 -> ผู้ชาย 5 คน ต่อ คนทั้งหมด 15 คน

P(x) Predictor Prior probability = 12/15
    หมายถึงมีคนผิวขาวจำนวน 12 คนจากทั้งหมด 15 คน

#ดังนั้นหากแทนค่าในสูตรจะได้
    ค่าของ P(c=เพศหญิง|x) = 0.75
    ค่าของ P(c=เพศชาย|x) = 0.25
    จะมีคนผิวขาวที่เป็นเพศหญิง 75% และเป็นเพศชาย 25%
"""